app/controllers/comments_controller.rb

  def create
    #debugger
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create!(params[:comment])
---
SELECT * FROM "posts" WHERE ("posts"."id" = '--- :post_id
INSERT INTO "comments" ("name", "created_at", "body", "updated_at", "post_id") VALUES('your mom', '2010-05-17 18:27:58', 'get off the computer, joey.', '2010-05-17 18:27:58', 1)

  def destroy
    @comment = Comment.find(params[:id])
    @post = @comment.post
    @comment.destroy
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 1)
DELETE FROM `comments` WHERE `id` = 1