app/controllers/posts_controller.rb

SELECT * FROM `posts`
---
  def index
    @posts = Post.all

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
---
  def show
    @post = Post.find(params[:id])

SELECT * FROM `posts` WHERE (`posts`.`id` = 8)
---
  def edit
    @post = Post.find(params[:id])

INSERT INTO `posts` (`created_at`, `title`, `body`, `updated_at`) VALUES('2010-05-17 21:17:50', 'it is title, after all', 'It has been determined that it was title, and not subject, as previously thought.', '2010-05-17 21:17:50')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT * FROM `posts` WHERE (`posts`.`id` = 8)
UPDATE `posts` SET `updated_at` = '2010-05-18 18:17:24', `body` = 'an edit' WHERE `id` = 8
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])

SELECT * FROM `posts` WHERE (`posts`.`id` = 8)
DELETE FROM `posts` WHERE `id` = 8
---
  def destroy
    @post = Post.find(params[:id])
    @post.destroy